app/Controllers/home_admin.php

    public function index()
    {
        // Asegurarse de que la sesión esté activa
        if (session()->get('logged_in')) {
            $model = new ProductoModel();
            // Obtener todos los productos de la base de datos
            $data['productos'] = $model->findAll();
---
SELECT *
FROM `producto`

public function view_modificar_producto()
{
    // Asegurarse de que la sesión esté activa
    if (session()->get('logged_in')) {
        $model = new ProductoModel();
        // Obtener todos los productos de la base de datos
        $data['productos'] = $model->findAll();  // Pasamos todos los productos a la vista
---
SELECT *
FROM `producto`


    // Actualizar el producto usando el método update() del modelo
    // Asegúrate de que el ID se pase correctamente
    if (!$model->update($id_producto, $data)) {
---
UPDATE `producto` SET `nombre_producto` = 'Sudadera anti Gripp', `precio_producto` = '0.00', `imagen_producto` = '1727645456_8758d16b68fb63166a51.webp'
WHERE `producto`.`id_productos` IN ('37')