app/Controllers/Home.php

SELECT *
FROM `producto`
---
    public function index(): string
    {
        // Cargar el modelo de productos
        $productoModel = new ProductoModel();

        // Obtener todos los productos de la base de datos
        $productos = $productoModel->findAll();

SELECT *
FROM `producto`
WHERE `producto`.`id_productos` = '41'
---
    public function view_simulacion($id_productos): string
    {
        // Cargar el modelo de productos y simulaciones
        $productoModel = new ProductoModel();
        $simulacionModel = new SimulacionModel();

        // Obtener el producto y la simulación asociados por ID
        $producto = $productoModel->find($id_productos);