app/Controllers/login.php

SELECT *
FROM `login_admin`
WHERE `usuario_login` = 'admin123'
 LIMIT 1
---
    public function validarIngreso()
    {
        // Instancia del modelo LoginAdmin
        $login_admin = new LoginAdmin();

        // Obtener datos del formulario de forma segura
        $usuario = $this->request->getPost('usuario_login');
        $contrasenia = $this->request->getPost('contrasenia_login');

        // Buscar el usuario en la base de datos
        $user = $login_admin->where('usuario_login', $usuario)->first();